[Killed] StringLiteral
main/components/Users/UsersTable.js:29:38
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleAdminCallback = async(cell) => { 
         const confirmation = window
-                            .confirm("Are you sure you want to revoke Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
+                            .confirm("");
         if (confirmation)
         {
killedBy: UserTable tests Confirmation popup appears when toggle-admin button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to revoke Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep your Admin rights active."
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:30:13
     const toggleAdminCallback = async(cell) => { 
         const confirmation = window
                             .confirm("Are you sure you want to revoke Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
-        if (confirmation)
+        if (true)
         {
             toggleAdminMutation.mutate(cell);
killedBy: UserTable tests toggleAdminMutation is not triggered when confirmation popup is canceled
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 2

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:30:13
     const toggleAdminCallback = async(cell) => { 
         const confirmation = window
                             .confirm("Are you sure you want to revoke Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
-        if (confirmation)
+        if (false)
         {
             toggleAdminMutation.mutate(cell);
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Users/UsersTable.js:31:9
         const confirmation = window
                             .confirm("Are you sure you want to revoke Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
         if (confirmation)
-        {
-            toggleAdminMutation.mutate(cell);
-        } 
+        {} 
     }
 
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:86:21
             accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
         },
         {
-            Header: 'Instructor',
+            Header: "",
             id: 'instructor',
             accessor: (row, _rowIndex) => String(row.instructor) // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Instructor. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/Users/UsersTable.js:95:22
     const buttonColumn = [
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable")
+        ButtonColumn("", "primary", toggleInstructorCallback, "UsersTable")
     ]
     return <OurTable
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: A column ID (or string accessor) is required!
