[Killed] BlockStatement
main/components/Courses/CoursesTable.js:16:37
          navigate(`/courses/edit/${cell.row.values.id}`);
      };
 
-     const joinCallback = (cell) => {
-        navigate(`/courses/join/${cell.row.values.id}`); //JOIN
-    };
+     const joinCallback = (cell) => {};
 
      // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Join button navigates to the join page for any user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/join/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:17:18
      };
 
      const joinCallback = (cell) => {
-        navigate(`/courses/join/${cell.row.values.id}`); //JOIN
+        navigate(``); //JOIN
     };
 
killedBy: UserTable tests Join button navigates to the join page for any user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/join/1"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:64:89
      ];
         columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable")); //JOIN
 
-     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         //columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable")); //JOIN
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-     }
+     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
      return <OurTable
killedBy: CourseIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
