[Killed] ConditionalExpression
main/components/Users/UsersTable.js:30:12
 
     // Stryker disable next-line all
     const toggleAdminCallback = async(cell) => { 
-        if(currentUser.root.user.githubId === cell.row.values.githubId) {
+        if(true) {
             const confirmation = window
                                 .confirm("Are you sure you want to revoke your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
killedBy: UserTable tests Correct confirmation popup appears when admin toggles other admin's toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to revoke user's Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep user's Admin rights active."
Received: "Are you sure you want to revoke your own Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep your Admin rights active."

Number of calls: 1

[Killed] StringLiteral
main/components/Users/UsersTable.js:32:42
     const toggleAdminCallback = async(cell) => { 
         if(currentUser.root.user.githubId === cell.row.values.githubId) {
             const confirmation = window
-                                .confirm("Are you sure you want to revoke your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
+                                .confirm("");
             if (confirmation)
             {
killedBy: UserTable tests Confirmation popup appears when admin toggles their own toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to revoke your own Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep your Admin rights active."
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:33:17
         if(currentUser.root.user.githubId === cell.row.values.githubId) {
             const confirmation = window
                                 .confirm("Are you sure you want to revoke your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
-            if (confirmation)
+            if (false)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: UserTable tests Confirmation popup appears when admin toggles their own toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:33:17
         if(currentUser.root.user.githubId === cell.row.values.githubId) {
             const confirmation = window
                                 .confirm("Are you sure you want to revoke your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
-            if (confirmation)
+            if (true)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: UserTable tests mockToggleMutation is not called when admin does not confirm
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] BlockStatement
main/components/Users/UsersTable.js:38:14
                 toggleAdminMutation.mutate(cell);
             } 
         }
-        else {
-            const confirmation = window
-                                .confirm("Are you sure you want to revoke user's Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep user's Admin rights active.");
-            if (confirmation)
-            {
-                toggleAdminMutation.mutate(cell);
-            } 
-        }
+        else {}
     }
 
killedBy: UserTable tests Correct confirmation popup appears when admin toggles other admin's toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to revoke user's Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep user's Admin rights active."

Number of calls: 0

[Killed] StringLiteral
main/components/Users/UsersTable.js:40:42
         }
         else {
             const confirmation = window
-                                .confirm("Are you sure you want to revoke user's Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep user's Admin rights active.");
+                                .confirm("");
             if (confirmation)
             {
killedBy: UserTable tests Correct confirmation popup appears when admin toggles other admin's toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to revoke user's Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep user's Admin rights active."
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:41:17
         else {
             const confirmation = window
                                 .confirm("Are you sure you want to revoke user's Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep user's Admin rights active.");
-            if (confirmation)
+            if (true)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: UserTable tests Correct confirmation popup appears when admin toggles other admin's toggle-admin button
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:41:17
         else {
             const confirmation = window
                                 .confirm("Are you sure you want to revoke user's Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep user's Admin rights active.");
-            if (confirmation)
+            if (false)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
