[Killed] BooleanLiteral
main/components/Users/UsersTable.js:7:78
 import { useBackendMutation } from "main/utils/useBackend";
 //import { useCurrentUser } from "main/utils/currentUser";
 
-export default function UsersTable({ currentUser, users, showToggleButtons = false }) {
+export default function UsersTable({ currentUser, users, showToggleButtons = true }) {
     // const currentUser = useCurrentUser();
     // toggleAdmin
killedBy: UserTable tests Does not see toggle admin and instructor buttons as regular user
statusReason: TestingLibraryElementError: Found multiple elements with the text: toggle-admin

Here are the matching elements:

<th
  colspan="1"
  data-testid="UsersTable-header-toggle-admin"
  role="columnheader"

[Killed] BlockStatement
main/components/Users/UsersTable.js:31:73
 
     // Stryker disable next-line all
     const toggleAdminCallback = async(cell) => { 
-        if(currentUser.root.user.githubId === cell.row.values.githubId) {
-            const confirmation = window
-                                .confirm("Are you sure you want to modify your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
-
-            if (confirmation)
-            {
-                toggleAdminMutation.mutate(cell);
-            } 
-        }
+        if(currentUser.root.user.githubId === cell.row.values.githubId) {}
         else {
             const confirmation = window
killedBy: UserTable tests Confirmation popup appears when admin toggles their own toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to modify your own Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep your Admin rights active."

Number of calls: 0

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:31:12
 
     // Stryker disable next-line all
     const toggleAdminCallback = async(cell) => { 
-        if(currentUser.root.user.githubId === cell.row.values.githubId) {
+        if(false) {
             const confirmation = window
                                 .confirm("Are you sure you want to modify your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
killedBy: UserTable tests Confirmation popup appears when admin toggles their own toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to modify your own Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep your Admin rights active."
Received: "Are you sure you want to modify user's Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep user's Admin rights active."

Number of calls: 1

[Killed] StringLiteral
main/components/Users/UsersTable.js:33:42
     const toggleAdminCallback = async(cell) => { 
         if(currentUser.root.user.githubId === cell.row.values.githubId) {
             const confirmation = window
-                                .confirm("Are you sure you want to modify your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
+                                .confirm("");
 
             if (confirmation)
killedBy: UserTable tests Confirmation popup appears when admin toggles their own toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to modify your own Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep your Admin rights active."
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:35:17
             const confirmation = window
                                 .confirm("Are you sure you want to modify your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
 
-            if (confirmation)
+            if (true)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: UserTable tests mockToggleMutation is not called when admin does not confirm
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:35:17
             const confirmation = window
                                 .confirm("Are you sure you want to modify your own Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep your Admin rights active.");
 
-            if (confirmation)
+            if (false)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: UserTable tests Confirmation popup appears when admin toggles their own toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/Users/UsersTable.js:40:14
                 toggleAdminMutation.mutate(cell);
             } 
         }
-        else {
-            const confirmation = window
-                                .confirm("Are you sure you want to modify user's Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep user's Admin rights active.");
-            if (confirmation)
-            {
-                toggleAdminMutation.mutate(cell);
-            } 
-        }
+        else {}
     }
 
killedBy: UserTable tests Correct confirmation popup appears when admin toggles other admin's toggle-admin button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to modify user's Admin rights?·
Click 'OK' to confirm or 'Cancel' to keep user's Admin rights active."

Number of calls: 0

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:43:17
         else {
             const confirmation = window
                                 .confirm("Are you sure you want to modify user's Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep user's Admin rights active.");
-            if (confirmation)
+            if (true)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: UserTable tests Correct confirmation popup appears when admin toggles other admin's toggle-admin button
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:43:17
         else {
             const confirmation = window
                                 .confirm("Are you sure you want to modify user's Admin rights?\n\nClick 'OK' to confirm or 'Cancel' to keep user's Admin rights active.");
-            if (confirmation)
+            if (false)
             {
                 toggleAdminMutation.mutate(cell);
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:73:13
     const toggleInstructorCallback = async(cell) => { 
         const confirmation = window
                             .confirm("Are you sure you want to modify Instructor role?\n\nClick 'OK' to confirm or 'Cancel' to keep current role.");
-        if (confirmation) {
+        if (true) {
             toggleInstructorMutation.mutate(cell);
         } 
killedBy: UserTable tests mockToggleMutation for toggle-instructor-button is not called when admin does not confirm
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] BlockStatement
main/components/Users/UsersTable.js:73:27
     const toggleInstructorCallback = async(cell) => { 
         const confirmation = window
                             .confirm("Are you sure you want to modify Instructor role?\n\nClick 'OK' to confirm or 'Cancel' to keep current role.");
-        if (confirmation) {
-            toggleInstructorMutation.mutate(cell);
-        } 
+        if (confirmation) {} 
     }
 
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
