[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:7:30
 import { useBackend } from "main/utils/useBackend";
 import { useCurrentUser } from "main/utils/currentUser";
 
-const AdminUsersPage = () => {
-
-    const { data: users, error: _error, status: _status } =
-        useBackend(
-            // Stryker disable next-line all : don't test internal caching of React Query
-            ["/api/admin/users"],
-            // Stryker disable next-line StringLiteral,ObjectLiteral : since "GET" is default, "" is an equivalent mutation
-            { method: "GET", url: "/api/admin/users" },
-            // Stryker disable next-line all
-            []
-        )
-
-    const {data: currentUser} = useCurrentUser();
-
-    return (
-        <BasicLayout>
-            <h2>Users</h2>
-            <UsersTable currentUser = {currentUser} users={users} showToggleButtons={true} />
-        </BasicLayout>
-    );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: AdminUsersPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:24:86
     return (
         <BasicLayout>
             <h2>Users</h2>
-            <UsersTable currentUser = {currentUser} users={users} showToggleButtons={true} />
+            <UsersTable currentUser = {currentUser} users={users} showToggleButtons={false} />
         </BasicLayout>
     );
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-admin-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
