[Killed] BlockStatement
main/components/Courses/CoursesTable.js:14:38
      const editCallback = (cell) => {
          navigate(`/courses/edit/${cell.row.values.id}`);
      };
-     const staffCallback = (cell) => {
-        navigate(`/courses/${cell.row.values.id}/staff`);
-    };
+     const staffCallback = (cell) => {};
 
      // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Staff button navigates to the staff page for an admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/1/staff"

Number of calls: 0

<html>
  <head />

[Survived] StringLiteral
main/components/Courses/CoursesTable.js:64:45
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Staff", "danger", staffCallback, "CoursesTable"));
+         columns.push(ButtonColumn("Staff", "", staffCallback, "CoursesTable"));
      }
 
