[Killed] StringLiteral
main/components/Users/UsersTable.js:87:43
     const buttonColumn = [
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable"),
+        ButtonColumn("toggle-instructor", "", toggleInstructorCallback, "UsersTable"),
         
     ]
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
