[Killed] ConditionalExpression
src/main/utils/dateUtils.js:27:52
     }
 
     // Check if timeString is a float (timestamp) or ISO 8601 date string
-    const isFloatTimestamp = !isNaN(timeString) && timeString.toString().indexOf('.') !== -1;
+    const isFloatTimestamp = !isNaN(timeString) && true;
     const timestamp = isFloatTimestamp ? Number(timeString) * 1000 : Date.parse(timeString);
 
killedBy: dateUtils tests formatTime float timestamp detection tests should correctly differentiate between float and non-float numeric strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Invalid date"
Received: "Online now"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:27:30
     }
 
     // Check if timeString is a float (timestamp) or ISO 8601 date string
-    const isFloatTimestamp = !isNaN(timeString) && timeString.toString().indexOf('.') !== -1;
+    const isFloatTimestamp = true;
     const timestamp = isFloatTimestamp ? Number(timeString) * 1000 : Date.parse(timeString);
 
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "Invalid date"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:28:42
 
     // Check if timeString is a float (timestamp) or ISO 8601 date string
     const isFloatTimestamp = !isNaN(timeString) && timeString.toString().indexOf('.') !== -1;
-    const timestamp = isFloatTimestamp ? Number(timeString) * 1000 : Date.parse(timeString);
+    const timestamp = isFloatTimestamp ? Number(timeString) / 1000 : Date.parse(timeString);
 
     if (isNaN(timestamp)) {
killedBy: dateUtils tests formatTime tests should correctly handle float timestamp
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "5 minutes ago"
Received: "12/31/1969"

[Killed] BlockStatement
src/main/utils/dateUtils.js:30:27
     const isFloatTimestamp = !isNaN(timeString) && timeString.toString().indexOf('.') !== -1;
     const timestamp = isFloatTimestamp ? Number(timeString) * 1000 : Date.parse(timeString);
 
-    if (isNaN(timestamp)) {
-        return "Invalid date"; // or handle invalid input as you see fit
-    }
+    if (isNaN(timestamp)) {}
 
     const now = new Date();
killedBy: dateUtils tests formatTime tests should return "Invalid date" for incorrect input
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Invalid date"
Received: "Invalid Date"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:36:36
 
     const now = new Date();
     const dateFromEpoch = new Date(timestamp);
-    const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
+    const secondsPast = Math.floor((now - dateFromEpoch) * 1000);
 
     if (secondsPast < minutesInSeconds * 2) {
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "5/31/2022"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:36:37
 
     const now = new Date();
     const dateFromEpoch = new Date(timestamp);
-    const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
+    const secondsPast = Math.floor((now + dateFromEpoch) / 1000);
 
     if (secondsPast < minutesInSeconds * 2) {
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "5/31/2022"

[Killed] BlockStatement
src/main/utils/dateUtils.js:42:38
         return 'Online now';
     }
 
-    if (secondsPast < hourInSeconds) {
-        const minutes = Math.floor(secondsPast / minutesInSeconds);
-        return `${minutes} minutes ago`;
-    }
+    if (secondsPast < hourInSeconds) {}
 
     if (secondsPast < dayInSeconds) {
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "0 hour ago"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:43:36
     }
 
     if (secondsPast < hourInSeconds) {
-        const minutes = Math.floor(secondsPast / minutesInSeconds);
+        const minutes = Math.floor(secondsPast * minutesInSeconds);
         return `${minutes} minutes ago`;
     }
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "7200 minutes ago"

[Killed] BlockStatement
src/main/utils/dateUtils.js:47:37
         return `${minutes} minutes ago`;
     }
 
-    if (secondsPast < dayInSeconds) {
-        const hours = Math.floor(secondsPast / hourInSeconds);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
-    }
+    if (secondsPast < dayInSeconds) {}
     
     if (secondsPast < weekInSeconds) {
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "0 day ago"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:48:34
     }
 
     if (secondsPast < dayInSeconds) {
-        const hours = Math.floor(secondsPast / hourInSeconds);
+        const hours = Math.floor(secondsPast * hourInSeconds);
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
     }
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "38880000 hours ago"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:49:32
 
     if (secondsPast < dayInSeconds) {
         const hours = Math.floor(secondsPast / hourInSeconds);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
+        return `${hours} hour${false ? 's' : ''} ago`;
     }
     
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "3 hour ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:49:32
 
     if (secondsPast < dayInSeconds) {
         const hours = Math.floor(secondsPast / hourInSeconds);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
+        return `${hours} hour${hours <= 1 ? 's' : ''} ago`;
     }
     
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "3 hour ago"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:53:33
     }
     
     if (secondsPast < weekInSeconds) {
-        const days = Math.floor(secondsPast / dayInSeconds);
+        const days = Math.floor(secondsPast * dayInSeconds);
         return `${days} day${days > 1 ? 's' : ''} ago`;
     }
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "14929920000 days ago"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:54:30
     
     if (secondsPast < weekInSeconds) {
         const days = Math.floor(secondsPast / dayInSeconds);
-        return `${days} day${days > 1 ? 's' : ''} ago`;
+        return `${days} day${false ? 's' : ''} ago`;
     }
 
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "2 day ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:54:30
     
     if (secondsPast < weekInSeconds) {
         const days = Math.floor(secondsPast / dayInSeconds);
-        return `${days} day${days > 1 ? 's' : ''} ago`;
+        return `${days} day${days <= 1 ? 's' : ''} ago`;
     }
 
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "2 day ago"
